---
kind: property
id: P:Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.CurrentObject
source: html/38e2dc21-846e-599f-83cf-e1f83964cb77.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```